backend/views/cashdesk-timesheet/index.php

SELECT * FROM "cashdesk_timesheet" ORDER BY "cashier"
---
                    return $model->cashier;
                },
               /* 'filterType'=>GridView::FILTER_SELECT2,
                'filter'=>ArrayHelper::map(CashdeskTimesheet::find()->orderBy('cashier')->asArray()->all(), 'cashier', 'cashier'),